openfoam_case/fluid/system/controlDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
application     pimpleFoam;
 
startFrom       startTime;
 
startTime       0;
 
stopAt          endTime;
 
endTime         0.5;
 
deltaT          0.005;
 
writeControl    timeStep;
 
writeInterval   20;
 
purgeWrite      1;
 
writeFormat     ascii;
 
writePrecision  6;
 
writeCompression off;
 
timeFormat      general;
 
timePrecision   6;
 
adjustTimeStep  no;
 
runTimeModifiable true;
 
functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}