openfoam_case/fluid/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  8                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Define vertices of the block
vertices
(
    (-2 -2 -2)
(-2 -2 2)
(-2 2 -2)
(-2 2 2)
(2 -2 -2)
(2 -2 2)
(2 2 -2)
(2 2 2)
);

// Define a single block using hexahedral cells
blocks
(
    hex (0 4 6 2 1 5 7 3) (10 10 10) simpleGrading (1 1 1)
);

// Boundary conditions
edges
(
    
);

// Patch definitions
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 3 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 6 7 5)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (6 2 3 7)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 6 2)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (1 5 7 3)
        );
    }
);

// Default internal field
mergePatchPairs
(
    
);
