openfoam_case/fluid/system/snappyHexMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  8                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

// Settings for snappyHexMesh
castellatedMesh true;
snap            true;
addLayers       false;
mergeTolerance 1e-6;

geometry
{
    tesla_translated.stl
    {
        type triSurfaceMesh;
        name stl;

    };

    box
    {
        type searchableBox;
        min (-10 -10 -10);
        max (10 10 10);
    };

    sphere
    {
        type searchableSphere;
        centre (0 0 0);
        radius 15.0;

    };
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    nCellsBetweenLevels 1;

    resolveFeatureAngle 30;
    planarAngle 30;
    allowFreeStandingZoneFaces true;

    features
    (
        {
            file tesla_translated.eMesh;
            level 2;
        }
    );

    refinementSurfaces
    {
        stl
        {
            level (1 1);
        }

        sphere
        {
            level (1 1);
            faceZone face_inner;
            cellZone cell_inner;
            cellZoneInside inside;
        }
    }

    refinementRegions
    {
        box
        {
            mode inside;
            levels ((1 1));
        }
    }

    locationInMesh (0.0 0.0 0.25);
};

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;

        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
};

addLayersControls
{
    relativeSizes true;
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.25;

    layers
    {

    }
};

meshQualityControls
{
    maxNonOrtho 75;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1.00E-13;
    minTetQuality 1e15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    minFlatness 0.5;
    nSmoothScale 4;
    errorReduction 0.75;
};
